Revit 2027 API
ExportLineweightTable.GetKeys Method
 Gets all the keys stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportLineweightKey> GetKeys()
Public Function GetKeys As IList(Of ExportLineweightKey)
public:
IList<ExportLineweightKey^>^ GetKeys()
member GetKeys : unit -> IList<ExportLineweightKey>
Return Value
IList<ExportLineweightKey>
 The keys.
See Also
Reference
ExportLineweightTable Class
Autodesk.Revit.DB Namespace